app/Http/Controllers/ArticleController.php

select * from `articles`
---
    public function index()
    {
        $articles = Article::paginate(10);