app/Http/Controllers/BranchController.php

select * from `branches`
---
    public function index()
    {
        $branch = Branch::all();