app/Http/Controllers/CustomerController.php

select * from `customers`
---
    public function index()
    {
        $customer = Customer::all();

insert into `customers` (`name`, `phone`, `address`, `updated_at`, `created_at`) values ('tes', '91238210', 'alamat', '2025-04-10 04:11:16', '2025-04-10 04:11:16')
---
    public function store(Request $request)
    {
        $validated = $request->validate([
            'name' => 'required',
            'phone' => 'required|max:15',
            // 'city_id' => 'required|exists:cities,id',
            // 'subdistrict_id' => 'required|exists:subdistricts,id',
            // 'village_id' => 'required|exists:villages,id',
            'address' => 'required',
        ], [
            'phone.required' => 'Nomor telepon wajib diisi.',
            'phone.max' => 'Nomor telepon tidak boleh lebih dari 15 karakter.',
            // 'city_id.required' => 'Kota wajib dipilih.',
            // 'city_id.exists' => 'Kota tidak ditemukan.',
            // 'subdistrict_id.required' => 'Kecamatan wajib dipilih.',
            // 'subdistrict_id.exists' => 'Kecamatan tidak ditemukan.',
            // 'village_id.required' => 'Desa wajib dipilih.',
            // 'village_id.exists' => 'Desa tidak ditemukan.',
            'address.required' => 'Alamat wajib diisi.',
        ]);

        $customer = Customer::create($validated);

select * from `customers` where `customers`.`id` = '1' limit 1
update `customers` set `name` = 'Customer A1', `phone` = '1112223331', `address` = 'Address A1', `customers`.`updated_at` = '2025-04-10 04:12:04' where `id` = 1
---
    public function update(Request $request, string $id)
    {
        $validated = $request->validate([
            'name' => 'required',
            'phone' => 'required|max:15',
            // 'city_id' => 'required|exists:cities,id',
            // 'subdistrict_id' => 'required|exists:subdistricts,id',
            // 'village_id' => 'required|exists:villages,id',
            'address' => 'required',
        ], [
            'phone.required' => 'Nomor telepon wajib diisi.',
            'phone.max' => 'Nomor telepon tidak boleh lebih dari 15 karakter.',
            // 'city_id.required' => 'Kota wajib dipilih.',
            // 'city_id.exists' => 'Kota tidak ditemukan.',
            // 'subdistrict_id.required' => 'Kecamatan wajib dipilih.',
            // 'subdistrict_id.exists' => 'Kecamatan tidak ditemukan.',
            // 'village_id.required' => 'Desa wajib dipilih.',
            // 'village_id.exists' => 'Desa tidak ditemukan.',
            'address.required' => 'Alamat wajib diisi.',
        ]);

        $customer = Customer::findOrFail($id);
        $customer->update($validated);

select * from `customers` where `customers`.`id` = '3' limit 1
delete from `customers` where `id` = 3
---
    public function destroy(string $id)
    {
        $customer = Customer::findOrFail($id);
        $customer->delete();