app/Http/Controllers/PaymentMethodController.php

select * from `payment_methods`
select * from `branches`
---
    public function index()
    {
        $payment_method = PaymentMethod::all();
        $cabangs = Branch::all();

select * from `payment_methods` where `payment_methods`.`id` = '3' limit 1
delete from `payment_methods` where `id` = 3
---
    public function destroy(string $id)
    {
        $paymentMethod = PaymentMethod::findOrFail($id);
        $paymentMethod->delete();