app/Http/Controllers/ServicePromotionController.php

select * from `services`
select * from `service_promotions`
select * from `branches`
---
    public function index()
    {
        $services = Service::all();
        $service_promotion = ServicePromotion::paginate(10);
        $cabangs = Branch::all();