app/Http/Controllers/ServiceController.php

select * from `services`
select * from `branches`
---
    public function index()
    {
        $service = Service::all();
        $cabangs = Branch::all();