app/Http/Controllers/UserController.php

select * from `users`
select * from `branches`
---
    public function index()
    {
        $users = User::all();
        $branch = Branch::all();